performance/results/stampede/20260806-194633-before-single-flight/run-1.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: performance/k6/popular-accommodation-stampede.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * cold_cache_burst: 1 iterations for each of 10 VUs (maxDuration: 30s, gracefulStop: 30s)



  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 10      55.532417/s
    checks_succeeded...: 100.00% 10 out of 10
    checks_failed......: 0.00%   0 out of 10

    ✓ HTTP 상태가 200이다

    HTTP
    http_req_duration..............: avg=171.21ms min=170.85ms med=171.11ms p(95)=171.71ms p(99)=171.78ms max=171.79ms
      { expected_response:true }...: avg=171.21ms min=170.85ms med=171.11ms p(95)=171.71ms p(99)=171.78ms max=171.79ms
    http_req_failed................: 0.00%  0 out of 10
    http_reqs......................: 10     55.532417/s

    EXECUTION
    iteration_duration.............: avg=179.21ms min=177.87ms med=179.52ms p(95)=179.62ms p(99)=179.68ms max=179.69ms
    iterations.....................: 10     55.532417/s

    NETWORK
    data_received..................: 16 kB  86 kB/s
    data_sent......................: 1.2 kB 6.7 kB/s



running (0m00.2s), 00/10 VUs, 10 complete and 0 interrupted iterations
cold_cache_burst ✓ [ 100% ] 10 VUs  00.2s/30s  10/10 iters, 1 per VU