performance/results/stampede/20260806-194633-before-single-flight/run-3.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: performance/k6/popular-accommodation-stampede.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * cold_cache_burst: 1 iterations for each of 10 VUs (maxDuration: 30s, gracefulStop: 30s)



  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 10      447.227191/s
    checks_succeeded...: 100.00% 10 out of 10
    checks_failed......: 0.00%   0 out of 10

    ✓ HTTP 상태가 200이다

    HTTP
    http_req_duration..............: avg=17.66ms min=17.15ms med=17.39ms p(95)=18.94ms p(99)=19.82ms max=20.04ms
      { expected_response:true }...: avg=17.66ms min=17.15ms med=17.39ms p(95)=18.94ms p(99)=19.82ms max=20.04ms
    http_req_failed................: 0.00%  0 out of 10
    http_reqs......................: 10     447.227191/s

    EXECUTION
    iteration_duration.............: avg=19.7ms  min=19.25ms med=19.41ms p(95)=20.96ms p(99)=21.85ms max=22.07ms
    iterations.....................: 10     447.227191/s

    NETWORK
    data_received..................: 16 kB  695 kB/s
    data_sent......................: 1.2 kB 54 kB/s



running (0m00.0s), 00/10 VUs, 10 complete and 0 interrupted iterations
cold_cache_burst ✓ [ 100% ] 10 VUs  00.0s/30s  10/10 iters, 1 per VU